app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def new
    @beer = Beer.new
	@breweries = Brewery.all

SELECT "breweries".* FROM "breweries"
---
  def edit
	@breweries = Brewery.all

INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 8], ["created_at", Sun, 26 Jan 2014 14:15:51 UTC +00:00], ["name", "Boringza"], ["style", "Juopps"], ["updated_at", Sun, 26 Jan 2014 14:15:51 UTC +00:00]]
SELECT "breweries".* FROM "breweries"
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
        format.html { redirect_to beers_path, notice: 'Beer was successfully created.' }
        format.json { render action: 'show', status: :created, location: @beer }
      else
	@breweries = Brewery.all