app/controllers/ratings_controller.rb

	def create
	@rating = Rating.create params.require(:rating).permit(:score, :beer_id)
	if @rating.save
		current_user.ratings << @rating
		redirect_to user_path current_user
	else
		@beers = Beer.all
---
INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 3], ["created_at", Sun, 26 Jan 2014 13:23:55 UTC +00:00], ["score", 3], ["updated_at", Sun, 26 Jan 2014 13:23:55 UTC +00:00]]
UPDATE "ratings" SET "user_id" = ?, "updated_at" = ? WHERE "ratings"."id" = 25  [["user_id", 2], ["updated_at", Sun, 02 Feb 2014 15:24:33 UTC +00:00]]
SELECT "beers".* FROM "beers"

	def destroy
	rating = Rating.find(params[:id])
	rating.delete if current_user == rating.user
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "ratings" WHERE "ratings"."id" = 16