app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Sun, 02 Feb 2014 13:20:57 UTC +00:00], ["updated_at", Sun, 02 Feb 2014 13:20:57 UTC +00:00], ["username", "Koo"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save